--[[
	太阳神三国杀武将单挑对战平台·☆SP武将包
	武将总数：10
	武将一览：
		1、赵云（龙胆、冲阵）
		2、貂蝉（离魂、闭月）
		3、曹仁（溃围、严整）
		4、庞统（漫卷、醉乡）
		5、张飞（嫉恶、大喝）
		6、吕蒙（驱虎、谋断）+（谦逊、激昂、英姿、克己）
		7、刘备（昭烈、誓仇）
		8、大乔（言笑、安娴）
		9、甘宁（银铃、军威）
		10、夏侯惇（愤勇、雪恨）
]]--
--[[****************************************************************
	称号：白马先锋
	武将：赵云
	势力：群
	性别：男
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：龙胆
	描述：
]]--
--[[
	技能：冲阵
	描述：每当你发动“龙胆”使用或打出一张手牌时，你可以获得对方的一张手牌。
]]--
--武将信息：赵云
ZhaoYun = sgs.CreateLuaGeneral{
	name = "bgm_zhaoyun",
	real_name = "zhaoyun",
	translation = "☆SP·赵云",
	show_name = "赵云",
	title = "白马先锋",
	kingdom = "qun",
	maxhp = 3,
	order = 7,
	designer = "Danny",
	cv = "墨宣砚韵",
	illustrator = "Vincent",
	skills = {},
	last_word = "力量不及，请原谅……",
	resource = "zhaoyun",
}
--[[****************************************************************
	称号：暗黑的傀儡师
	武将：貂蝉
	势力：群
	性别：女
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：离魂（阶段技）
	描述：你可以弃置一张牌将武将牌翻面，并选择一名男性角色：若如此做，你获得该角色的所有手牌，且出牌阶段结束时，你交给该角色X张牌。（X为该角色的体力值）
]]--
--[[
	技能：闭月
	描述：
]]--
--武将信息：貂蝉
DiaoChan = sgs.CreateLuaGeneral{
	name = "bgm_diaochan",
	real_name = "diaochan",
	translation = "☆SP·貂蝉",
	show_name = "貂蝉",
	title = "暗黑的傀儡师",
	kingdom = "qun",
	maxhp = 3,
	order = 9,
	designer = "Danny",
	cv = "蒲小猫",
	illustrator = "木美人",
	skills = {},
	last_word = "董贼已除，我又当何如……",
	resource = "diaochan",
}
--[[****************************************************************
	称号：险不辞难
	武将：曹仁
	势力：魏
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：溃围
	描述：结束阶段开始时，你可以摸X+2张牌：若如此做，将武将牌翻面，且你的下个摸牌阶段开始时，你弃置X张牌。（X为场上武器牌的数量）
]]--
--[[
	技能：严整
	描述：若你的手牌数大于你的体力值，你可以将一张装备区的牌当【无懈可击】使用。
]]--
--武将信息：曹仁
CaoRen = sgs.CreateLuaGeneral{
	name = "bgm_caoren",
	real_name = "caoren",
	translation = "☆SP·曹仁",
	show_name = "曹仁",
	title = "险不辞难",
	kingdom = "wei",
	maxhp = 4,
	order = 6,
	designer = "Danny",
	cv = "喵小林",
	illustrator = "张帅",
	skills = {},
	last_word = "城在人在，城破……人亡……",
	resource = "caoren",
}
--[[****************************************************************
	称号：荆楚之高俊
	武将：庞统
	势力：群
	性别：男
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：漫卷
	描述：每当你将获得一张手牌时，你将之置入弃牌堆。若你的回合内你发动“漫卷”，你可以获得弃牌堆中一张与此牌同点数的牌（不能发动“漫卷”）。
]]--
--[[
	技能：醉乡（限定技）
	描述：准备阶段开始时，你可以将牌堆顶的三张牌置于你的武将牌上。此后每个准备阶段开始时，你重复此流程，直到你的武将牌上出现同点数的“醉乡牌”，然后你获得所有“醉乡牌”（不能发动“漫卷”）。你不能使用或打出“醉乡牌”中存在的类别的牌，且这些类别的牌对你无效。
]]--
--武将信息：庞统
PangTong = sgs.CreateLuaGeneral{
	name = "bgm_pangtong",
	real_name = "pangtong",
	translation = "☆SP·庞统",
	show_name = "庞统",
	title = "荆楚之高俊",
	kingdom = "qun",
	maxhp = 3,
	order = 10,
	designer = "Danny",
	cv = "墨宣砚韵",
	illustrator = "LiuHeng",
	skills = {},
	last_word = "纵有治世才，难遇治世主……",
	resource = "pangtong",
}
--[[****************************************************************
	称号：横矛立马
	武将：张飞
	势力：蜀
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：嫉恶（锁定技）
	描述：你使用红色【杀】对目标角色造成伤害时，此伤害+1。
]]--
--[[
	技能：大喝（阶段技）
	描述：你可以与一名其他角色拼点：若你赢，你可以将该角色的拼点牌交给一名体力值不大于你的角色，本回合该角色使用的非红桃【闪】无效；若你没赢，你展示所有手牌，然后弃置一张手牌。
]]--
--武将信息：张飞
ZhangFei = sgs.CreateLuaGeneral{
	name = "bgm_zhangfei",
	real_name = "zhangfei",
	translation = "☆SP·张飞",
	show_name = "张飞",
	title = "横矛立马",
	kingdom = "shu",
	maxhp = 4,
	order = 6,
	designer = "Serendipity",
	cv = "喵小林",
	illustrator = "绿豆粥",
	skills = {},
	last_word = "大哥……二哥……",
	resource = "zhangfei",
}
--[[****************************************************************
	称号：国士之风
	武将：吕蒙
	势力：吴
	性别：男
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：探虎（阶段技）
	描述：你可以与一名其他角色拼点：若你赢，你无视与该角色的距离，你使用的非延时锦囊牌对该角色结算时不能被【无懈可击】响应，直到回合结束。
]]--
--[[
	技能：谋断
	描述：游戏开始时，你获得一枚“文/武”标记且“武”朝上。若你的手牌数小于或等于2，你的标记为“文”朝上。其他角色的回合开始时，若“文”朝上，你可以弃置一张牌：若如此做，你将标记翻至“武”朝上。若“武”朝上，你拥有“谦逊”和“激昂”；若“文”朝上，你拥有“英姿”和“克己”。
]]--
--[[
	技能：谦逊
	描述：
]]--
--[[
	技能：激昂
	描述：
]]--
--[[
	技能：英姿
	描述：
]]--
--[[
	技能：克己
	描述：
]]--
--武将信息：吕蒙
LvMeng = sgs.CreateLuaGeneral{
	name = "bgm_lvmeng",
	real_name = "lvmeng",
	translation = "☆SP·吕蒙",
	show_name = "吕蒙",
	title = "国士之风",
	kingdom = "wu",
	maxhp = 3,
	order = 10,
	designer = "如水法师卞程",
	cv = "风叹息",
	illustrator = "YellowKiss",
	skills = {},
	last_word = "未见吴之天下，怎敢轻生……",
	resource = "lvmeng",
}
--[[****************************************************************
	称号：汉昭烈帝
	武将：刘备
	势力：蜀
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：昭烈
	描述：摸牌阶段，你可以少摸一张牌并选择你攻击范围内的一名角色：若如此做，你亮出牌堆顶的三张牌，将其中的非基本牌和【桃】置入弃牌堆，然后该角色选择一项：1.受到X点伤害，然后获得其余的牌；2.弃置X张牌，然后令你获得其余的牌。（X为其中非基本牌的数量）
]]--
--[[
	技能：誓仇（主公技、限定技）[空壳技能]
	描述：准备阶段开始时，你可以选择一名其他蜀势力角色并交给其两张牌。每当你受到伤害时，你将此伤害转移给该角色，此伤害结算后该角色摸X张牌，直到其第一次进入濒死状态时。（X为伤害点数）
]]--
--武将信息：刘备
LiuBei = sgs.CreateLuaGeneral{
	name = "bgm_liubei",
	real_name = "liubei",
	translation = "☆SP·刘备",
	show_name = "刘备",
	title = "汉昭烈帝",
	kingdom = "shu",
	maxhp = 4,
	order = 5,
	designer = "妄想线条",
	cv = "喵小林",
	illustrator = "Fool头",
	skills = {},
	last_word = "一时不仁，毁己功业，吾悔矣……",
	resource = "liubei",
}
--[[****************************************************************
	称号：韶光易逝
	武将：大乔
	势力：吴
	性别：女
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：言笑
	描述：出牌阶段，你可以将一张方块牌置于一名角色的判定区内，称为“言笑牌”。判定区内有“言笑牌”的角色的判定阶段开始时获得其判定区内所有牌。
]]--
--[[
	技能：安娴
	描述：每当你使用【杀】对目标角色造成伤害时，你可以防止此伤害：若如此做，该角色弃置一张手牌，然后你摸一张牌。每当你成为【杀】的目标时，你可以弃置一张手牌：若如此做，此【杀】的使用者摸一张牌，此【杀】对你无效。
]]--
--武将信息：大乔
DaQiao = sgs.CreateLuaGeneral{
	name = "bgm_daqiao",
	real_name = "daqiao",
	translation = "☆SP·大乔",
	show_name = "大乔",
	title = "韶光易逝",
	kingdom = "wu",
	maxhp = 3,
	female = true,
	order = 5,
	designer = "ECauchy",
	cv = "蒲小猫",
	illustrator = "木美人",
	skills = {},
	last_word = "青灯常伴，了此余生……",
	resource = "daqiao",
}
--[[****************************************************************
	称号：怀铃的乌羽
	武将：甘宁
	势力：群
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：银铃
	描述：出牌阶段，若“锦”的数量少于四张，你可以弃置一张黑色牌并选择一名其他角色：若如此做，你将该角色的一张牌置于你的武将牌上，称为“锦”。
]]--
--[[
	技能：军威
	描述：结束阶段开始时，你可以将三张“锦”置入弃牌堆并选择一名角色：若如此做，该角色可以展示一张【闪】并将之交给由你选择的一名角色，否则该角色失去1点体力，你将其装备区的一张牌移出游戏：若如此做，该角色的回合结束后，将这张装备牌移回其装备区（代替原装备）。
]]--
--武将信息：甘宁
GanNing = sgs.CreateLuaGeneral{
	name = "bgm_ganning",
	real_name = "ganning",
	translation = "☆SP·甘宁",
	show_name = "甘宁",
	title = "怀铃的乌羽",
	kingdom = "qun",
	maxhp = 4,
	order = 9,
	designer = "飞雪",
	cv = "风叹息",
	illustrator = "张帅",
	skills = {},
	last_word = "小的们，点子扎手，扯呼！",
	resource = "ganning",
}
--[[****************************************************************
	称号：啖睛的苍狼
	武将：夏侯惇
	势力：魏
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：愤勇
	描述：每当你受到伤害后，你可以竖置体力牌。一名角色的结束阶段开始时，若你的体力牌处于竖置状态，你横置之。每当你受到伤害时，若你的体力牌处于竖置状态，防止此伤害。
]]--
--[[
	技能：雪恨（锁定技）
	描述：每当你的体力牌横置时，你选择一项：
		1.弃置当前回合角色X张牌。 
		2.视为你使用一张无距离限制的【杀】。（X为你已损失的体力值）
]]--
--武将信息：夏侯惇
XiaHouDun = sgs.CreateLuaGeneral{
	name = "bgm_xiahoudun",
	real_name = "xiahoudun",
	translation = "☆SP·夏侯惇",
	show_name = "夏侯惇",
	title = "啖睛的苍狼",
	kingdom = "wei",
	maxhp = 4,
	order = 7,
	designer = "舟亢",
	cv = "喵小林",
	illustrator = "XXX",
	skills = {},
	last_word = "凛然领军出，马革裹尸还……",
	resource = "xiahoudun",
}
--[[****************************************************************
	☆SP武将包
]]--****************************************************************
return sgs.CreateLuaPackage{
	name = "bgm",
	translation = "☆SP包",
	generals = {
		ZhaoYun, DiaoChan, CaoRen, PangTong, ZhangFei,
		LvMeng, LiuBei, DaQiao, GanNing, XiaHouDun,
	},
}