--[[
	太阳神三国杀武将单挑对战平台·山武将包
	武将总数：8
	武将一览：
		1、张郃（巧变）
		2、邓艾（屯田、凿险）+（急袭）
		3、姜维（挑衅、志继）+（观星）
		4、刘禅（享乐、放权、若愚）+（激将）
		5、孙策（激昂、魂姿、制霸）+（英姿、英魂）
		6、张昭张纮（直谏、固政）
		7、左慈（化身、新生）
		8、蔡文姬（悲歌、断肠）
]]--
--[[****************************************************************
	称号：料敌机先
	武将：张郃
	势力：魏
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：巧变
	描述：
]]--
--武将信息：张郃
ZhangHe = sgs.CreateLuaGeneral{
	name = "zhanghe",
	translation = "张郃",
	title = "料敌机先",
	kingdom = "wei",
	order = 5,
	cv = "爪子",
	illustrator = "张帅",
	last_word = "归兵勿追，追兵难归啊……",
	resource = "zhanghe",
}
--[[****************************************************************
	称号：矫然的壮士
	武将：邓艾
	势力：魏
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：屯田
	描述：
]]--
--[[
	技能：凿险
	描述：
]]--
--[[
	技能：急袭
	描述：
]]--
--武将信息：邓艾
DengAi = sgs.CreateLuaGeneral{
	name = "dengai",
	translation = "邓艾",
	title = "矫然的壮士",
	kingdom = "wei",
	order = 7,
	cv = "烨子",
	last_word = "吾破蜀克敌，竟葬于奸贼之手！",
	resource = "dengai",
}
--[[****************************************************************
	称号：龙的衣钵
	武将：姜维
	势力：蜀
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：挑衅
	描述：
]]--
--[[
	技能：志继
	描述：
]]--
--[[
	技能：观星
	描述：
]]--
--武将信息：姜维
JiangWei = sgs.CreateLuaGeneral{
	name = "jiangwei",
	translation = "姜维",
	title = "龙的衣钵",
	kingdom = "shu",
	order = 8,
	cv = "Jr. Wakaran，LeleK",
	last_word = "臣等正欲死战，陛下何故先降？",
	resource = "jiangwei",
}
--[[****************************************************************
	称号：无为的真命主
	武将：刘禅
	势力：蜀
	性别：男
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：享乐
	描述：
]]--
--[[
	技能：放权
	描述：
]]--
--[[
	技能：若愚
	描述：
]]--
--[[
	技能：激将
	描述：
]]--
--武将信息：刘禅
LiuShan = sgs.CreateLuaGeneral{
	name = "liushan",
	translation = "刘禅",
	title = "无为的真命主",
	kingdom = "shu",
	maxhp = 3,
	order = 6,
	cv = "V7",
	illustrator = "LiuHeng",
	last_word = "吾降！吾降矣……",
	resource = "liushan",
}
--[[****************************************************************
	称号：江东的小霸王
	武将：孙策
	势力：吴
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：激昂
	描述：
]]--
--[[
	技能：魂姿
	描述：
]]--
--[[
	技能：制霸
	描述：
]]--
--[[
	技能：英姿
	描述：
]]--
--[[
	技能：英魂
	描述：
]]--
--武将信息：孙策
SunCe = sgs.CreateLuaGeneral{
	name = "sunce",
	translation = "孙策",
	title = "江东的小霸王",
	kingdom = "wu",
	order = 6,
	cv = "猎狐",
	last_word = "内事不决问张昭，外事不决问周瑜……",
	resource = "sunce",
}
--[[****************************************************************
	称号：经天纬地
	武将：张昭张纮
	势力：吴
	性别：男
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：直谏
	描述：
]]--
--[[
	技能：固政
	描述：
]]--
--武将信息：张昭张纮
ZhangZhaoZhangHong = sgs.CreateLuaGeneral{
	name = "zhangzhaozhanghong",
	translation = "张昭张纮",
	title = "经天纬地",
	kingdom = "wu",
	maxhp = 3,
	order = 1,
	cv = "喵小林，风叹息",
	illustrator = "废柴男",
	last_word = "此生智谋，已为江东尽……",
	resource = "zhangzhaozhanghong",
}
--[[****************************************************************
	称号：迷之仙人
	武将：左慈
	势力：群
	性别：男
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：化身
	描述：
]]--
--[[
	技能：新生
	描述：
]]--
--武将信息：左慈
ZuoCi = sgs.CreateLuaGeneral{
	name = "zuoci",
	translation = "左慈",
	title = "迷之仙人",
	kingdom = "qun",
	maxhp = 3,
	order = 8,
	cv = "东方胤弘，眠眠",
	illustrator = "废柴男",
	last_word = "释知遗形，神灭形消……",
	resource = "zuoci",
}
--[[****************************************************************
	称号：异乡的孤女
	武将：蔡文姬
	势力：群
	性别：女
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：悲歌
	描述：
]]--
--[[
	技能：断肠
	描述：
]]--
--武将信息：蔡文姬
CaiWenJi = sgs.CreateLuaGeneral{
	name = "caiwenji",
	real_name = "caiyan",
	translation = "蔡文姬",
	title = "异乡的孤女",
	kingdom = "qun",
	female = true,
	maxhp = 3,
	order = 5,
	cv = "呼呼",
	illustrator = "Sonia Tang",
	resource = "caiyan",
}
--[[****************************************************************
	山武将包
]]--****************************************************************
return sgs.CreateLuaPackage{
	name = "mountain",
	translation = "山包",
	generals = {
		ZhangHe, DengAi, JiangWei, LiuShan, SunCe, ZhangZhaoZhangHong, ZuoCi, CaiWenJi,
	},
}