--[[
	太阳神三国杀武将单挑对战平台·林武将包
	武将总数：8
	武将一览：
		1、徐晃（断粮）
		2、曹丕（行殇、放逐、颂威）
		3、孟获（祸首、再起）
		4、祝融（巨象、烈刃）
		5、孙坚（英魂）
		6、鲁肃（好施、缔盟）
		7、董卓（酒池、肉林、崩坏、暴虐）
		8、贾诩（完杀、乱武、帷幕）
]]--
--[[****************************************************************
	称号：周亚夫之风
	武将：徐晃
	势力：魏
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：断粮
	描述：
]]--
--武将信息：徐晃
XuHuang = sgs.CreateLuaGeneral{
	name = "xuhuang",
	translation = "徐晃",
	title = "周亚夫之风",
	kingdom = "wei",
	order = 7,
	cv = "木津川",
	illustrator = "Tuu.",
	last_word = "生遇明主，死亦无憾！",
	death_audio = "xuhuang/xuhuang.ogg",
}
--[[****************************************************************
	称号：霸业的继承者
	武将：曹丕
	势力：魏
	性别：男
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：行殇
	描述：
]]--
--[[
	技能：放逐
	描述：
]]--
--[[
	技能：颂威
	描述：
]]--
--武将信息：曹丕
CaoPi = sgs.CreateLuaGeneral{
	name = "caopi",
	translation = "曹丕",
	title = "霸业的继承者",
	kingdom = "wei",
	maxhp = 3,
	order = 1,
	cv = "V7，殆尘，烨子，蒲小猫",
	illustrator = "Sonia Tang",
	last_word = "嗟我白发，生一何早；长吟永叹，怀我圣考……",
	death_audio = "caopi/caopi.ogg",
}
--[[****************************************************************
	称号：南蛮王
	武将：孟获
	势力：蜀
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：祸首
	描述：
]]--
--[[
	技能：再起
	描述：
]]--
--武将信息：孟获
MengHuo = sgs.CreateLuaGeneral{
	name = "menghuo",
	translation = "孟获",
	title = "南蛮王",
	kingdom = "shu",
	order = 7,
	cv = "墨染の飞猫",
	illustrator = "废柴男",
	last_word = "荆民之地，再无主矣！",
	death_audio = "menghuo/menghuo.ogg",
}
--[[****************************************************************
	称号：野性的女王
	武将：祝融
	势力：蜀
	性别：女
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：巨象
	描述：
]]--
--[[
	技能：烈刃
	描述：
]]--
--武将信息：祝融
ZhuRong = sgs.CreateLuaGeneral{
	name = "zhurong",
	translation = "祝融",
	title = "野性的女王",
	kingdom = "shu",
	female = true,
	order = 4,
	cv = "妙妙",
	illustrator = "废柴男",
	last_word = "大王，火神湮世，妾身去矣！",
	death_audio = "zhurong/zhurong.ogg",
}
--[[****************************************************************
	称号：武烈帝
	武将：孙坚
	势力：吴
	性别：男
	体力上限：4勾玉
]]--****************************************************************
--[[
	技能：英魂
	描述：
]]--
--武将信息：孙坚
SunJian = sgs.CreateLuaGeneral{
	name = "sunjian",
	translation = "孙坚",
	title = "武烈帝",
	kingdom = "wu",
	order = 6,
	cv = "木津川",
	illustrator = "LiuHeng",
	last_word = "死去何愁无勇将，英魂依旧卫江东……",
	death_audio = "sunjian/sunjian.ogg",
}
--[[****************************************************************
	称号：独断的外交家
	武将：鲁肃
	势力：吴
	性别：男
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：好施
	描述：
]]--
--[[
	技能：缔盟
	描述：
]]--
--武将信息：鲁肃
LuSu = sgs.CreateLuaGeneral{
	name = "lusu",
	translation = "鲁肃",
	title = "独断的外交家",
	kingdom = "wu",
	maxhp = 3,
	order = 3,
	cv = "听雨",
	illustrator = "LiuHeng",
	last_word = "荆湘未还，虽死难安……",
	death_audio = "lusu/lusu.ogg",
}
--[[****************************************************************
	称号：魔王
	武将：董卓
	势力：群
	性别：男
	体力上限：8勾玉
]]--****************************************************************
--[[
	技能：酒池
	描述：
]]--
--[[
	技能：肉林
	描述：
]]--
--[[
	技能：崩坏
	描述：
]]--
--[[
	技能：暴虐
	描述：
]]--
--武将信息：董卓
DongZhuo = sgs.CreateLuaGeneral{
	name = "dongzhuo",
	translation = "董卓",
	title = "魔王",
	kingdom = "qun",
	maxhp = 8,
	order = 4,
	cv = "やまもとみ，迷宫女友(肉林2)",
	illustrator = "小冷",
	last_word = "吾儿奉先何在？呃……",
	death_audio = "dongzhuo/dongzhuo.ogg",
}
--[[****************************************************************
	称号：冷酷的毒士
	武将：贾诩
	势力：群
	性别：男
	体力上限：3勾玉
]]--****************************************************************
--[[
	技能：完杀
	描述：
]]--
--[[
	技能：乱武
	描述：
]]--
--[[
	技能：帷幕
	描述：
]]--
--武将信息：贾诩
JiaXu = sgs.CreateLuaGeneral{
	name = "jiaxu",
	translation = "贾诩",
	title = "冷酷的毒士",
	kingdom = "qun",
	maxhp = 3,
	order = 3,
	cv = "落凤一箭",
	last_word = "大势已去，吾不能自保矣……",
	death_audio = "jiaxu/jiaxu.ogg",
}
--[[****************************************************************
	林武将包
]]--****************************************************************
return sgs.CreateLuaPackage{
	name = "thicket",
	translation = "林包",
	generals = {
		XuHuang, CaoPi, MengHuo, ZhuRong, SunJian, LuSu, DongZhuo, JiaXu,
	},
}